{
    "title": "Sanju",
    "year": 2018,
    "rating": 3.5,
    "image": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-u5hbg5hnbvi4dn15876abid8m3-20180629123211.Medi.jpeg",
    "reviewDate": "November 19, 2020",
    "review": "Been a minute since I watched an India movie and thought I would rewatch this rollercoaster of a movie again. I think the story and performances worked for me. I loved Ranbir Kapoor's chemistry with Vicky Kaushal and Paresh Rawal, which is the movie's biggest strength. All three did an excellent job with their respective roles. I loved what Kapoor brought to each scene playing as Sanjay Dutt throughout the movie. Although the story was a bit messy going from telling a story about a damaged drug addict to an actor branded as a terrorist, I loved how they told it. Normally I have a problem with movies that transitions to a different storyline like Dear Comrade and Maharshi. But this felt more streamlined and its a biopic, so it gets a pass. Both stories were told excellently, especially when Sanjay Dutt was trying to stay sober. I don't know if it was just me or not, but I thought for sure that the man was a terrorist before I saw this movie for the first time. But, as the movie progresses, I enjoyed how the movie debunks those thoughts and how the media doesn't spare the man from anything.\nNow for the actual issues of the movie. I do think that this movie falls into some cliches like reminding the audience of a previous event that happened that ties into what's happening at the moment and a couple of melodramatic scenes. There is also a scene where Sanjay Dutt reads the speech after his father passes. I don't think that he should have read the speech out loud while his father was going to get cremated. I think it took away some of that emotion from the previous scene where Sanjay Dutt felt regret and sorrow when he didn't read it in front of a big audience. I get we are supposed to feel empathy for Sanjay Dutt after he read the speech but I think that could have served well if he either read that speech at the beginning of the movie or not read it at all. But that's just me.\nAnother thing that bothered me was the anti-media message in the movie. Don't get me wrong, I liked that they were saying something about the media spreading fake news. But, I didn't like how it hindered Dutt's character development. Yeah, we noticed that Sanjay Dutt changes and develops as a better person. But did we feel him going through those changes? I did for the first half of the movie but not the second half of the movie. The reason why the first half, in my opinion, was better than the second half was that I felt Sanjay Dutt's change in that arch. He wanted to come clean with drugs after his mom died. Once the Bombay Blasts storyline kicks in, the movie focuses on the anti-media message rather than Sanjay Dutt's change throughout that phase. Thinking about this more, it didn't bother me as much since its a biopic film and was supposed to recount the major events of his life. But I can't help but think they could've done a better job at telling that part of Dutt's arch without changing its focus.\nAt the end of the day, I enjoyed the story and performances despite its major flaws. I keep rewatching the movie mostly because of Kapoor's performance and arch and his scenes with Khoushal and Rawal."
}