{
    "title": "Unbreakable",
    "year": 2000,
    "rating": 4.5,
    "image": "https://images.squarespace-cdn.com/content/v1/5cfd23da9f33530001f33f4f/1560186772690-SDIEH741F0TZ9NENRY98/ke17ZwdGBToddI8pDm48kL-2NPTcQbX2Z2XyS65Xm6pZw-zPPgdn4jUwVcJE1ZvWQUxwkmyExglNqGp0IvTJZUJFbgE-7XRK3dMEBRBhUpzhrdwph1Syt1erWFyguPX8LigxFe9-DbyRUDsOB_hyrsyS6LI8tnmaaGjhBt58JhM/unbreakable.jpg?format=750w",
    "reviewDate": "July 16, 2020",
    "review": "The second feature film and first in the Eastrail 177 trilogy by M Night Shyamalan stars Bruce Willis, Samuel L Jackson, Spencer Treat Clark, Robin Wright. This movie showcases David Dunn (Willis), former football star turned security guard for a stadium, who survives a derailed train accident where everyone except David has died in the accident. Elijah Price (Jackson), a comic book art gallery owner, comes to David after the accident to show him that Dunn is a superhero and his theory that comic books are an exaggeration of the truth. Elijah is shown to have osteogenesis imperfecta, which is a disease where his bones are easily broken while David is, literally, unbreakable since he has never been sick in his life nor have had any serious injuries in his life. This contrast between the two characters have a purpose later in the story, but the rest of the movie shows how David discovers and explores his superpower of super strength and read people’s past by touching them. As per Shyamalan’s twist endings, David discovers a shocking twist when he discovers how he and Elijah got to where they are.\nI remember watching this movie for the first time a few years ago when I started getting into movies. I watched Shyamalan’s The Sixth Sense before and was immediately a fan of that movie. I loved the story and direction and was fascinated by the filmmaking. I also saw this at a time when I was (and still am) an MCU fan. So, hearing about Unbreakable being a superhero movie at a time where superhero movies were not popular had me hyped going into this movie.\nI was kind of disappointed when I saw this movie for the first time since I was expecting some large-scale action scenes and quirky characters. I thought the twist ending was thrown in there because they realized they had a bland movie before the ending. The movie dragged for me, especially during the second act where David is just lifting weights and being “emotionless”.\nHowever, after visiting this movie over the past couple of years, I have grown to love this movie after viewing it as a thriller than a superhero movie. Some of the flaws I had the first time didn’t seem like issues. I really like Bruce Willis as David Dunn. He doesn’t show his emotions as explicitly as I thought. But after paying more attention to his character, you can tell how his character is feeling in each scene. He isn’t meant to be a charismatic character like Tony Stark, but as a guy figuring out who he is and what he wants to be. The “Sixth Sense”-ish twist ending worked on later viewing after I understood what this movie is about, though I still feel like it’s thrown in there.\nSamuel L Jackson, and everyone one else, were are great in the movie. The score was great. The script is really good. Cinematography was solid. But what really impressed me the most is the direction. Over the last couple years, I really respect M Night Shyamalan as a director. I loved how he handled The Sixth Sense and the details in each scene where he very subtly implies that Malcolm is dead the entire time. This movie shows once again how great Shyamalan is as a director, despite his shortcomings later in his career. I loved his choices in color and how each character is assigned a character: David being green, Elijah with purple, and later on Kevin in Split with yellow. Each of those characters are also built into each character. Elijah’s gallery and clothes are purple, and David’s is some shade of green. I didn’t notice until later viewing and reading on this movie online that each shot was made to look like a comic book panel. All of these elements show how amazing M Night is as a director to me.\nDespite how great the movie is, I do have one issue with the movie. This movie still drags in the second act. Even if I know why these scenes happen, it didn’t really have me engaged with movie as much I want it to be. Maybe I just didn’t find those scenes interesting enough.\nOverall, Unbreakable is one of M Night Shyamalan’s best movies. It still holds up today where comic book movies are dominating the box office. It can absorb viewers into a world that is different than what we all have seen with a great plot, acting, and direction. This movie and the Sixth Sense are reasons why I love M Night Shyamalan and will continue to watch his movies, even if they are as bad as the Last Airbender.\n"
}