{
    "title": "The Wicker Man",
    "year": 2006,
    "rating": 1.5,
    "image": "https://bloody-disgusting.com/wp-content/uploads/2019/04/Wicker-Man-e1556216964674.jpg",
    "reviewDate": "May 30, 2020",
    "review": "My expectations for this movie were really REALLY low thanks to Chris Stuckman's hilariocity of this movie (which is a great review you should check it out). And I know that review had spoilers in there but I couldn't help but watch this movie to figure out if it was really as bad as people say with the movie in context. I watched the original to see how the story might play out (that and see why the rating downgraded from R to PG-13). I thought I was going to regret watching this since it might have been boring and a waste of time. The other alternative was I was going feel the same way as I would with Indian movies (shallow and made for the sake of making easy money). So those are pretty much what I had going into the movie.\nAfter watching it though, oh....my....god did this movie deliver. I did find the movie boring for a while since the story went exactly where I thought it might have gone. But shit that doesn't matter. I'm pretty sure I don't have to pick which scenes I would have picked apart and made fun of because everyone knows them already. But with the context of this movie though, it is sooo much funnier than what I have seen. And there were a couple of bonus scenes that I have not seen that I was crying on the floor for like the \"HOW\\'D IT GET BURNED\" scene and where Nic Cage was stealing some chick's bike. Oh my god Nic Cage. My god, I love you man. This is why I watch your movies. I loved you in Mandy now I love you so much more after this movie.\nIn all seriousness though, this movie as a whole is pretty bad, as other people on the Internet have pointed out. But these filmmakers had some good intentions. I believe Nic Cage said that he wanted to make a modern version of this movie (correct me if I'm wrong). So I can't really trash it that much given their intentions (although the downgrade of the rating makes me hesitant to say that but hey it is what it is). I might have enjoyed this one more than the original because of how hilarious and enjoyable this movie is. Although the original is a far better movie (and something I will definitely rewatch later), I could totally see myself watching this version more than the original."
}